## Pandas
### Operations

In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.DataFrame ({'col1':[1,2,3,4]
                    ,'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
df['col2'].unique() #valores unicos

array([444, 555, 666], dtype=int64)

In [10]:
len(df['col2'].unique()) #=df['col2'].nunique()

3

In [11]:
df['col2'].value_counts() # cuantos de cada valor

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [13]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [19]:
df[(df['col1']>2) | (df['col2']==2)]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [20]:
def times2(x):
    return x*2

In [21]:
df['col1'].sum()

10

In [22]:
df['col1'].apply(times2) # aplicamos la funci√≥n coustum

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [24]:
df['col3'].apply(lambda x: x*3)

0    abcabcabc
1    defdefdef
2    ghighighi
3    xyzxyzxyz
Name: col3, dtype: object

In [28]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [29]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [30]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
df.sort_values('col2',axis=0) # ordenar por un campo

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [34]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [37]:
data={'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,2,3,5,4,1]}
df = pd.DataFrame(data)

In [38]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  3
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [42]:
df.pivot_table(values='D',index=['A','B'],columns=['C']) # various index

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  2.0
    two  3.0  NaN